<a href="https://colab.research.google.com/github/Somesh99/Big_Data/blob/main/Bigdata_day1_19feb.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas

In [3]:
data=pandas.read_csv("IBMdata.csv")

In [4]:
data.shape

(1470, 35)

In [5]:
data.head()

   Age Attrition  ... YearsSinceLastPromotion  YearsWithCurrManager
0   41       Yes  ...                       0                     5
1   49        No  ...                       1                     7
2   37       Yes  ...                       0                     0
3   33        No  ...                       3                     0
4   27        No  ...                       2                     2

[5 rows x 35 columns]

In [6]:
import sqlalchemy

In [8]:
connection = sqlalchemy.create_engine('sqlite://', echo=False)

In [9]:
data.to_sql('employee',con=connection)  #(to convert dataframe into table format with table name is employee )

In [10]:
connection.execute("select * from employee limit 2").fetchall()

[(0, 41, 'Yes', 'Travel_Rarely', 1102, 'Sales', 1, 2, 'Life Sciences', 1, 1, 2, 'Female', 94, 3, 2, 'Sales Executive', 4, 'Single', 5993, 19479, 8, 'Y', 'Yes', 11, 3, 1, 80, 0, 8, 0, 1, 6, 4, 0, 5),
 (1, 49, 'No', 'Travel_Frequently', 279, 'Research & Development', 8, 1, 'Life Sciences', 1, 2, 3, 'Male', 61, 2, 2, 'Research Scientist', 2, 'Married', 5130, 24907, 1, 'Y', 'No', 23, 4, 4, 80, 1, 10, 3, 3, 10, 7, 1, 7)]

In [11]:
connection.execute("select count(*) from employee where age >50 limit 2").fetchall()

[(143,)]

In [14]:
connection.execute("select * from employee where age >50 and Department='Sales' limit 2").fetchall()

[(18, 53, 'No', 'Travel_Rarely', 1219, 'Sales', 2, 4, 'Life Sciences', 1, 23, 1, 'Female', 78, 2, 4, 'Manager', 4, 'Married', 15427, 22021, 2, 'Y', 'No', 16, 3, 3, 80, 0, 31, 3, 3, 25, 8, 3, 7),
 (63, 59, 'No', 'Travel_Rarely', 1435, 'Sales', 25, 3, 'Life Sciences', 1, 81, 1, 'Female', 99, 3, 3, 'Sales Executive', 1, 'Single', 7637, 2354, 7, 'Y', 'No', 11, 3, 4, 80, 0, 28, 3, 2, 21, 16, 7, 9)]

In [16]:
connection.execute("select min(age), max(dailyRate),avg(HourlyRate) from employee group by Department ").fetchall()

[(19, 1444, 64.3015873015873),
 (18, 1496, 66.16753381893861),
 (18, 1499, 65.5201793721973)]

In [18]:
connection.execute("select department, gender, min(age), max(age) from employee group by department, gender").fetchall()

[('Human Resources', 'Female', 25, 59),
 ('Human Resources', 'Male', 19, 59),
 ('Research & Development', 'Female', 18, 60),
 ('Research & Development', 'Male', 18, 60),
 ('Sales', 'Female', 18, 60),
 ('Sales', 'Male', 18, 60)]

In [19]:
connection.execute("select * from employee where age between 20 and 30 limit 2").fetchall()

[(4, 27, 'No', 'Travel_Rarely', 591, 'Research & Development', 2, 1, 'Medical', 1, 7, 1, 'Male', 40, 3, 1, 'Laboratory Technician', 2, 'Married', 3468, 16632, 9, 'Y', 'No', 12, 3, 4, 80, 1, 6, 3, 3, 2, 2, 2, 2),
 (7, 30, 'No', 'Travel_Rarely', 1358, 'Research & Development', 24, 1, 'Life Sciences', 1, 11, 4, 'Male', 67, 3, 1, 'Laboratory Technician', 3, 'Divorced', 2693, 13335, 1, 'Y', 'No', 22, 4, 2, 80, 1, 1, 2, 3, 1, 0, 0, 0)]

In [20]:
connection.execute("select * from employee where department not in ('Sales','Research & Development')and DailyRate>1300 limit 2").fetchall()

[(105, 59, 'No', 'Non-Travel', 1420, 'Human Resources', 2, 4, 'Human Resources', 1, 140, 3, 'Female', 32, 2, 5, 'Manager', 4, 'Married', 18844, 21922, 9, 'Y', 'No', 21, 4, 4, 80, 1, 30, 3, 3, 3, 2, 2, 2),
 (134, 26, 'No', 'Travel_Rarely', 1355, 'Human Resources', 25, 1, 'Life Sciences', 1, 177, 3, 'Female', 61, 3, 1, 'Human Resources', 3, 'Married', 2942, 8916, 1, 'Y', 'No', 23, 4, 4, 80, 1, 8, 3, 3, 8, 7, 5, 7)]

In [21]:
connection.execute("select * from employee where Gender like 'F%' and Department like 'S%' limit 2").fetchall()

[(0, 41, 'Yes', 'Travel_Rarely', 1102, 'Sales', 1, 2, 'Life Sciences', 1, 1, 2, 'Female', 94, 3, 2, 'Sales Executive', 4, 'Single', 5993, 19479, 8, 'Y', 'Yes', 11, 3, 1, 80, 0, 8, 0, 1, 6, 4, 0, 5),
 (18, 53, 'No', 'Travel_Rarely', 1219, 'Sales', 2, 4, 'Life Sciences', 1, 23, 1, 'Female', 78, 2, 4, 'Manager', 4, 'Married', 15427, 22021, 2, 'Y', 'No', 16, 3, 3, 80, 0, 31, 3, 3, 25, 8, 3, 7)]

In [23]:
connection.execute("select * from employee order by DailyRate desc limit 5").fetchall()

[(427, 60, 'No', 'Travel_Frequently', 1499, 'Sales', 28, 3, 'Marketing', 1, 573, 3, 'Female', 80, 2, 3, 'Sales Executive', 1, 'Married', 10266, 2845, 4, 'Y', 'No', 19, 3, 4, 80, 0, 22, 5, 4, 18, 13, 13, 11),
 (986, 39, 'No', 'Travel_Rarely', 1498, 'Sales', 21, 4, 'Life Sciences', 1, 1390, 1, 'Male', 44, 2, 2, 'Sales Executive', 4, 'Married', 6120, 3567, 3, 'Y', 'Yes', 12, 3, 4, 80, 2, 8, 2, 4, 5, 4, 1, 4),
 (155, 29, 'No', 'Non-Travel', 1496, 'Research & Development', 1, 1, 'Technical Degree', 1, 208, 4, 'Male', 41, 3, 2, 'Manufacturing Director', 3, 'Married', 4319, 26283, 1, 'Y', 'No', 13, 3, 1, 80, 1, 10, 1, 3, 10, 7, 0, 9),
 (1056, 28, 'Yes', 'Travel_Frequently', 1496, 'Sales', 1, 3, 'Technical Degree', 1, 1486, 1, 'Male', 92, 3, 1, 'Sales Representative', 3, 'Married', 2909, 15747, 3, 'Y', 'No', 15, 3, 4, 80, 1, 5, 3, 4, 3, 2, 1, 2),
 (471, 38, 'No', 'Travel_Rarely', 1495, 'Research & Development', 10, 3, 'Medical', 1, 634, 3, 'Female', 76, 3, 2, 'Healthcare Representative', 3, 'Married', 9824, 22174, 3, 'Y', 'No', 19, 3, 3, 80, 1, 18, 4, 3, 1, 0, 0, 0)]

In [25]:
connection.execute("update employee set department='marketing' where department='Sales' ")

In [26]:
connection.execute("select count(*) from employee").fetchall()

[(1470,)]

In [27]:
connection.execute("delete from employee where department ='marketing' ")

In [28]:
connection.execute("select count(*) from employee").fetchall()

[(1024,)]